<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web2/production","backend":"291e3ce8f58b04fae7da1ca59659968290d5c8b1d881a371e8cca13c05cdffb3","plan_job_ref":"Job Generate OpenTofu Plan #50 at https://github.com/alexangc/test-vercel-backend-hello-world-iac/actions/runs/21759305251","plan_out_hash":"8d87f5489fff1be1cfe38d905b5f3d6b3e73056117bf3242d64e773277ce9838","plan_hash":"307d9e55be20bdb87e1cd29ebdcea0c187b4269cfd0bdb513bb54409fbc8bc17","plan_text_format":"diff","version":"2.2.3","closed":true} -->
OpenTofu plan for __web2/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
!~      dev_command                                       = "echo 'Hello World, Web 2!' && npm run dev" -> "echo 'Hello World, Web 2' && npm run dev"
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
        id                                                = "prj_4igk5rFnp5HoO3YeuZjbFLg4lDhQ"
        name                                              = "web2"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply OpenTofu Plan #31](https://github.com/alexangc/test-vercel-backend-hello-world-iac/actions/runs/21759337845)